Repository: Poetro/weblabor.hu
Catalog: root/modules/aggregator/translations/aggregator-module.*.po
Languages: hu

source: The news aggregator is a powerful on-site RSS syndicator/news reader that can gather fresh content from news sites and weblogs around the web.
hu: A hírolvasó sokoldalú webes felületű hírcsatorna olvasási lehetőséget biztosít, összegyűjtve a különböző csatornák tartalmait a blogokról és más webhelyekről.

source: Users can view the latest news chronologically in the <a href="@aggregator">main news aggregator display</a> or by <a href="@aggregator-sources">source</a>. Administrators can add, edit and delete feeds and choose how often to check for newly updated news for each individual feed. Administrators can also tag individual feeds with categories, offering selective grouping of some feeds into separate displays. Listings of the latest news for individual sources or categorized sources can be enabled as blocks for display in the sidebar through the <a href="@admin-block">block administration page</a>. The news aggregator requires cron to check for the latest news from the sites to which you have subscribed. Drupal also provides a <a href="@aggregator-opml">machine-readable OPML file</a> of all of your subscribed feeds.
hu: A <a href="@aggregator">fő hírolvasó felület</a> visszamenőleges sorrendben mutatja be az új híreket, de <a href="@aggregator-sources">forrásonként</a> is lehetőség van az új hírcsatorna bejegyzések olvasására. A megfelelő jogosultságú felhasználók tudnak új csatornákat felvenni, illetve meglévőket törölni vagy szerkeszteni, beállítva az új hírek letöltésének gyakoriságát. Lehetőség van az egyes csatornák kategóriákhoz rendelésére, további alternatív olvasási módokat biztosítva. Az egyes források vagy kategóriák legutóbb beérkezett hírei külön blokkokban is megjelentethetőek a <a href="@admin-block">blokkok beállításainál</a>. A Drupal a beállított hírcsatornák <a href="@aggregator-opml">OMPL formátumú listáját</a> is előállítja.

source: For more information please read the configuration and customization handbook <a href="@aggregator">Aggregator page</a>.
hu: További információ a beállítási és testreszabási kézikönyv <a href="@aggregator">hírolvasóról szóló oldalán</a> található.

source: Thousands of sites (particularly news sites and weblogs) publish their latest headlines and/or stories in a machine-readable format so that other sites can easily link to them. This content is usually in the form of an <a href="http://blogs.law.harvard.edu/tech/rss">RSS</a> feed (which is an XML-based syndication standard). To display the feed or category in a block you must decide how many items to show by editing the feed or block and turning on the <a href="@block">feed's block</a>.
hu: Webhelyek ezrei (többek között híroldalak és blogok) teszik közzé friss tartalmaik listáját programok által könnyen kezelhető hírcsatorna formátumokban, annak érdekében, hogy más webhelyek könnyen beépíthessék azokat, és az érdeklődők könnyebben követhessék a változásokat, újdonságokat erre a célra kifejlesztett programok segítségével. Az ilyen csatornák jellemzően valamilyen XML alapú formátumban jelennek meg. A Drupal az <a href="http://blogs.law.harvard.edu/tech/rss">RSS</a>, <a href="http://web.resource.org/rss/1.0/">RDF</a> és <a href="http://www.atomenabled.org/">Atom</a> formátumokat támogatja. Nemcsak a csatornák olvasására nyílik lehetőség, hanem azok friss tartalmának <a href="@block">blokk formájú megjelenítésére</a> is.

source: Add a site that has an RSS/RDF/Atom feed. The URL is the full path to the feed file. For the feed to update automatically you must run "cron.php" on a regular basis. If you already have a feed with the URL you are planning to use, the system will not accept another feed with the same URL.
hu: Itt vehetőek fel újabb RSS, RDF vagy Atom hírcsatornák. A webcímnek a hírcsatorna teljes elérési útjának kell lennie. A csatorna rendszeres automatikus frissítéséhez az időzítő (cron) beállítása is szükséges. Kétszer nem vehető fel ugyanaz a hírcsatorna a rendszerbe.

source: Categories provide a way to group items from different news feeds together. Each news category has its own feed page and block. For example, you could tag various sport-related feeds as belonging to a category called <em>Sports</em>. News items can be added to a category automatically by setting a feed to automatically place its item into that category, or by using the categorize items link in any listing of news items.
hu: A kategóriák lehetővé teszik, hogy különböző csatornák elemeit közösen csoportosíthassuk. Minden kategóriához tartozik egy saját oldal és blokk.Lehetőség van például több sport témájú csatornában érkező híreket a <em>Sport</em> kategóriába sorolni. Ez a besorolás automatikusan is megvalósulhat, de a hírek kategorizálására egyenként is lehetőség van.

source: News aggregator
hu: Hírolvasó

source: Configure which content your site aggregates from other sites, how often it polls them, and how they're categorized.
hu: Milyen tartalmak aggregálását kell végrehajtani, milyen időközönként, mely kategóriákba helyezve az újdonságokat.

source: Add feed
hu: Csatorna hozzáadása

source: Remove items
hu: Hírek eltávolítása

source: Update items
hu: Hírek frissítése

source: Sources
hu: Források

source: OPML feed
hu: OPML csatorna

source: Categorize
hu: Kategorizálás

source: Edit feed
hu: Csatorna szerkesztése

source: Edit category
hu: Kategória szerkesztése

source: The list of tags which are allowed in feeds, i.e., which will not be removed by Drupal.
hu: A csatornákban érkező hírekben engedélyezett HTML elemek, melyeket a Drupal nem fog eltávolítani.

source: Items shown in sources and categories pages
hu: A csatornák és kategóriák oldalain megjelenő hírek száma

source: The number of items which will be shown with each feed or category in the feed and category summary pages.
hu: Az egyes csatorna illetve kategória oldalakon megjelenő hírek száma.

source: Discard news items older than
hu: Régi hírek törlése

source: Older news items will be automatically discarded. Requires crontab.
hu: A régebbi híreket a rendszer automatikusan törli a megadott idő után. Az időzítő (cron) szolgáltatás beállítása szükséges ennek működéséhez.

source: Category selection type
hu: Kategória választás módja

source: checkboxes
hu: jelölőnégyzetek

source: multiple selector
hu: többszörös választási lista

source: The type of category selection widget which is shown on categorization pages. Checkboxes are easier to use; a multiple selector is good for working with large numbers of categories.
hu: A kategorizálási oldalon megjelenő űrlapelemek formája. A jelölőnégyzeteket könnyebb használni, a többszörös választási listák viszont praktikusak sok kategória használata esetén.

source: !title category latest items
hu: !title kategória legutóbbi hírei

source: !title feed latest items
hu: !title csatorna legutóbbi hírei

source: Number of news items in block
hu: Egy blokkban megjelenő hírek száma

source: View this feed's recent news.
hu: A csatorna új híreinek megtekintése.

source: View this category's recent news.
hu: A kategória új híreinek megtekintése.

source: A category named %category already exists. Please enter a unique title.
hu: %category nevű kategória már létezik. Egyedi nevet kell megadni.

source: The category %category has been updated.
hu: %category kategória frissítve.

source: Category %category deleted.
hu: %category kategória törölve.

source: The category %category has been deleted.
hu: %category kategória törölve.

source: Category %category added.
hu: %category kategória hozzáadva.

source: The category %category has been added.
hu: %category kategória hozzáadva.

source: The name of the feed; typically the name of the web site you syndicate content from.
hu: A csatorna neve, jellemzően a csatornát szolgáltató webhely neve.

source: The fully-qualified URL of the feed.
hu: A csatorna teljes webcíme.

source: Update interval
hu: Frissítési időköz

source: The refresh interval indicating how often you want to update this feed. Requires crontab.
hu: A csatorna híreinek frissítési időköze. Helyes működéséhez időzítő (cron) támogatás szükséges.

source: Categorize news items
hu: Hírek kategorizálása

source: New items in this feed will be automatically filed in the checked categories as they are received.
hu: Az ebben a csatornában megjelenő hírek automatikusan a kiválasztott kategória besorolásokat is megkapják.

source: A feed named %feed already exists. Please enter a unique title.
hu: %feed nevű csatorna már létezik. Egyedi nevet kell megadni.

source: A feed with this URL %url already exists. Please enter a unique URL.
hu: %url webcímű csatorna már létezik. Egyedi webcímet kell megadni.

source: The feed %feed has been updated.
hu: %feed csatorna frissítve.

source: Feed %feed deleted.
hu: %feed csatorna törölve.

source: The feed %feed has been deleted.
hu: %feed csatorna törölve.

source: Feed %feed added.
hu: %feed csatorna hozzáadva.

source: The feed %feed has been added.
hu: %feed csatorna hozzáadva.

source: The news items from %site have been removed.
hu: %site webhely hírei törölve.

source: There is no new syndicated content from %site.
hu: %site webhelyen nincs új megosztott tartalom.

source: Updated URL for feed %title to %url.
hu: %title csatorna webcíme frissítve %url értékre.

source: There is new syndicated content from %site.
hu: %site webhelyen van új megosztott tartalom.

source: The feed from %site seems to be broken, due to "%error".
hu: %site hírcsatornája hibás. A hiba oka: %error.

source: The feed from %site seems to be broken, because of error "%error".
hu: %site hírcsatornája hibás. A hiba oka: %error.

source: The feed from %site seems to be broken, due to an error "%error" on line %line.
hu: %site hírcsatornája hibás. A hiba oka: %error - %line. sor.

source: The feed from %site seems to be broken, because of error "%error" on line %line.
hu: %site hírcsatornája hibás. A hiba oka: %error - %line. sor.

source: Feed overview
hu: Csatornák áttekintése

source: Items
hu: Hírek

source: Last update
hu: Utolsó frissítés

source: Next update
hu: Következő frissítés

source: %time left
hu: %time van hátra

source: remove items
hu: hírek eltávolítása

source: update items
hu: hírek frissítése

source: Category overview
hu: Kategóriák áttekintése

source: aggregator
hu: hírolvasó

source: aggregator - @title
hu: hírolvasó - @title

source: Save categories
hu: Kategóriák mentése

source: You are not allowed to categorize this feed item.
hu: Nincs megfelelő jogosultság a kategória beállítására.

source: The categories have been saved.
hu: Kategóriák mentve.

source: More
hu: Tovább

source: in category
hu: kategória:

source: aggregated feeds
hu: összevont hírcsatorna

source: URL:
hu: Webcím:

source: Updated:
hu: Frissült:

source: blog it
hu: blogbejegyzés írása erről

source: Comment on this news item in your personal blog.
hu: Hozzászólás ehhez a hírhez a személyes blogban.

source: %age old
hu: %age

source: %ago ago
hu: %ago

source: 1 item
hu: 1 hír

source: administer news feeds
hu: hírcsatornák szerkesztése

source: access news feeds
hu: hírcsatornák hozzáférése
