Repository: Poetro/weblabor.hu
Catalog: root/modules/profile/translations/profile-module.*.po
Languages: hu

source: The profile module allows you to define custom fields (such as country, real name, age, ...) in the user profile. This permits users of a site to share more information about themselves, and can help community-based sites to organize users around profile fields.
hu: A profil modul segítségével egyedi mezők (mint például ország, teljes név, kor stb.) helyezhetőek el a felhasználó profil oldalakra. Ezek segítségével a webhely felhasználói információkat oszthatnak meg egymással, segítve a közösségi alapú webhelyek önszerveződését.

source: <p>The following types of fields can be added to the user profile:</p> <ul> <li>single-line textfield</li> <li>multi-line textfield</li> <li>checkbox</li> <li>list selection</li> <li>freeform list</li> <li>URL</li> <li>date</li> </ul>
hu: <p>Az alábbi típusú mezők szerepelhetnek a felhasználói profilokban:</p> <ul> <li>egysoros szövegmező</li> <li>többsoros szövegmező</li> <li>jelölőnégyzet</li> <li>legördülő lista</li> <li>szabad szavas lista</li> <li>Webcím</li> <li>dátum</li> </ul>

source: For more information please read the configuration and customization handbook <a href="@profile">Profile page</a>.
hu: További információ a beállítási és testreszabási kézikönyv <a href="@profile">felhasználói profilokról szóló oldalán</a> található.

source: Here you can define custom fields that users can fill in in their user profile (such as <em>country</em>, <em>real name</em>, <em>age</em>, ...).
hu: Ezen az oldalon a felhasználók adatait bekérő űrlap elemei határozhatóak meg, mint például <em>ország</em>, <em>név</em>, <em>születési év</em> stb.

source: User list
hu: Felhasználó lista

source: Profiles
hu: Profilok

source: Create customizable fields for your users.
hu: Egyedi felhasználói mezők létrehozása.

source: Add field
hu: Mező hozzáadása

source: Profile category autocomplete
hu: Automatikus kiegészítés a profil kategóriához

source: Edit field
hu: Mező szerkesztése

source: Delete field
hu: Mező törlése

source: Profile autocomplete
hu: Automatikus kiegészítés a profilhoz

source: Author information
hu: A szerző adatai

source: Link to full user profile
hu: Link a teljes felhasználói profilra

source: Profile fields to display
hu: Megjelenítendő profil mezők

source: Select which profile fields you wish to display in the block. Only fields designated as public in the <a href="@profile-admin">profile field configuration</a> are available.
hu: Megadható, hogy mely profil mezők jelenjenek meg a blokkban. Csak azok közül lehet választani, amelyek a <a href="@profile-admin">profil mező beállításoknál</a> nyilvánosként kerültek elmentésre.

source: View full user profile
hu: A teljes felhasználói profil megtekintése

source: About %name
hu: %name adatai

source: edit %title
hu: %title szerkesztése

source: add new %type
hu: új %type hozzáadása

source: Field settings
hu: Mező beállítások

source: The category the new field should be part of. Categories are used to group fields logically. An example category is "Personal information".
hu: Ebbe a kategóriába tartozik a mező. A kategóriák a mezők logikai csoportosítására szolgálnak, mint például: „Személyes információk”.

source: The title of the new field. The title will be shown to the user. An example title is "Favorite color".
hu: Az új mező címe, melyet a felhasználó látni fog, például: „Kedvenc szín”.

source: Form name
hu: Mezőnév

source: The name of the field. The form name is not shown to the user but used internally in the HTML code and URLs. Unless you know what you are doing, it is highly recommended that you prefix the form name with <code>profile_</code> to avoid name clashes with other fields. Spaces or any other special characters except dash (-) and underscore (_) are not allowed. An example name is "profile_favorite_color" or perhaps just "profile_color".
hu: A űrlapmező neve. Ez a név a felhasználók számára nem látható, csak a HTML kódban és a webcímekben szerepel. Erősen ajánlott, hogy a <code>profile_</code> előtagot használjuk a mezőnevek előtt, megelőzendő a névütközéseket. Kötőjel (-) és aláhúzás (_) kivételével más speciális karakterek használata nem engedélyezett, szóközöket sem szabad alkalmazni. Jó mezőnevek például: „profile_favorite_color” vagy csak egyszerűen „profile_color”.

source: Explanation
hu: Magyarázat

source: An optional explanation to go with the new field. The explanation will be shown to the user.
hu: A mezőhöz tartozó, felhasználó számára megjelenő magyarázat. Ha a mező egyértelmű, akkor magyarázata üresen is maradhat.

source: Selection options
hu: Választási lehetőségek

source: A list of all options. Put each option on a separate line. Example options are "red", "blue", "green", etc.
hu: Választási lehetőségek listája. Minden elemet új sorba kell írni. Lehetséges elemek például „piros”, „kék”, „zöld” stb.

source: The weights define the order in which the form fields are shown. Lighter fields "float up" towards the top of the category.
hu: A súly határozza meg a mezők kategórián belüli megjelenésének sorrendjét. A könnyebb mezők „felemelkednek” a kategória teteje felé, a nehezebbek „lesüllyednek”.

source: Visibility
hu: Láthatóság

source: Hidden profile field, only accessible by administrators, modules and themes.
hu: Rejtett profil mező, csak adminisztrátorok, modulok és sminkek számára elérhető.

source: Private field, content only available to privileged users.
hu: Személyes mező, a tartalma csak arra jogosult felhasználók számára hozzáférhető.

source: Public field, content shown on profile page but not used on member list pages.
hu: Nyilvános mező, megjelenik a profil oldalon, de nem szerepel a tagokat listázó áttekintő oldalakon.

source: Public field, content shown on profile page and on member list pages.
hu: Nyilvános mező, megjelenik a profil oldalon és a tagokat listázó áttekintő oldalakon is.

source: Page title
hu: Oldal címe

source: To enable browsing this field by value, enter a title for the resulting page. The word <code>%value</code> will be substituted with the corresponding value. An example page title is "People whose favorite color is %value". This is only applicable for a public field.
hu: Az erre a mezőre azonos értéket megadott felhasználók listáját megjelenítő oldal címe. A címben a <code>%value</code> kifejezést a megfelelő érték helyettesíti. Például: „Azok a felhasználóink, akiknek kedvenc színe %value”. Csak akkor van értelme beállítani, ha a mező nyilvános.

source: To enable browsing this field by value, enter a title for the resulting page. An example page title is "People who are employed". This is only applicable for a public field.
hu: Az erre a mezőre azonos értéket megadott felhasználók listáját megjelenítő oldal címe. Például: „Sportszerető felhasználók”. Csak akkor van értelme beállítani, ha a mező nyilvános.

source: Form will auto-complete while user is typing.
hu: Az űrlapmező értékének gépelés közbeni automatikus kiegészítése.

source: The user must enter a value.
hu: A felhasználónak meg kell adnia egy értéket.

source: Visible in user registration form.
hu: Látható a felhasználó regisztrációs űrlapon.

source: Save field
hu: Mező mentése

source: The specified form name contains one or more illegal characters. Spaces or any other special characters except dash (-) and underscore (_) are not allowed.
hu: A megadott mezőnév egy vagy több érvénytelen karaktert tartalmaz. Kötőjel (-) és aláhúzás (_) kivételével más speciális karakter használata nem engedélyezett, szóköz sem adható meg.

source: The specified form name is reserved for use by Drupal.
hu: A megadott mezőnév a Drupal által már foglalt.

source: The specified category name is reserved for use by Drupal.
hu: A megadott kategórianév a Drupal általi használatra már foglalt.

source: The specified title is already in use.
hu: A megadott cím már foglalt.

source: The specified name is already in use.
hu: A megadott név már foglalt.

source: The field has been created.
hu: A mező létrehozva.

source: Profile field %field added under category %category.
hu: %field mező hozzáadva %category kategóriához.

source: The field has been updated.
hu: A mező frissítve.

source: Are you sure you want to delete the field %field?
hu: „%field” mező valóban törlendő?

source: This action cannot be undone. If users have entered values into this field in their profile, these entries will also be deleted. If you want to keep the user-entered data, instead of deleting the field you may wish to <a href="@edit-field">edit this field</a> and change it to a hidden profile field so that it may only be accessed by administrators.
hu: Ez a művelet nem vonható vissza. Ha a felhasználók ezt a mezőt kitöltötték a profiljukban, akkor az általuk megadott bejegyzések is törlődnek. Ha a bevitt értékek törlése nem kívánt, ez elkerülhető a <a href="@edit-field">mező szerkesztése</a> lapon rejtett típusúra állítva a mezőt. Ezután csak az adminisztrátorok érhetik el a tartalmát.

source: The field %field has been deleted.
hu: %field mező törölve.

source: Profile field %field deleted.
hu: %field mező törölve.

source: No fields defined.
hu: Nincs definiált mező.

source: Add new field
hu: Új mező hozzáadása

source: user list
hu: felhasználó lista

source: Put each item on a separate line or separate them by commas. No HTML allowed.
hu: Minden elemet külön sorba vagy vesszővel elválasztva kell írni. HTML kód használata nem engedélyezett.

source: The value provided for %field is not a valid URL.
hu: %field mező nem érvényes webcím.

source: The field %field is required.
hu: %field mező kötelező.

source: single-line textfield
hu: egysoros szövegmező

source: multi-line textfield
hu: többsoros szövegmező

source: checkbox
hu: jelölőnégyzet

source: list selection
hu: választólista

source: freeform list
hu: szabad formátumú lista

source: date
hu: dátum

source: profile
hu: profil
